{
  "categories": [
    {
      "id": "oolong",
      "name": "Oolong Series",
      "items": [
        {
          "name": "Triple Trouble Oolong",
          "description": "A guaranteed explosion of textures and flavours with every sip! The Triple Trouble is our team's favourite Milk Tea with chewy tapioca pearls, delicate and light grass jelly and a satisfying vanilla pudding."
        },
        {
          "name": "Oolong Pure Tea",
          "description": "Complex and bold like our Earl Grey Tea, yet light and floral like our Green Jasmine Tea. This unique tea is truly a hidden gem in our menu!"
        },
        {
          "name": "Oolong Milk Tea",
          "description": "Low-key, this is our team's favourite Milk Tea. It offers a unique blend of the floral and light Green Jasmine Tea and a strong presence of the Earl Grey Tea."
        },
        {
          "name": "Oolong Espresso Milk Tea",
          "description": "When bold meets bold. Our Oolong Milk Tea combined with Espresso is truly an elevated coffee with cream and sugar.. Or an elevated tea with milk!"
        },
        {
          "name": "Oolong Peach Tea",
          "description": "Our unique version of the well-known Peach Ice Tea. You will love it!"
        },
        {
          "name": "Oolong Lychee Tea",
          "description": "Lychee, combined with a complex and unique tea. Definitely one of our team's favourite!"
        }
      ]
    },
    {
      "id": "classics",
      "name": "Classics & Milk Teas",
      "items": [
        {
          "name": "Pure Tea",
          "description": "Our signature, freshly brewed ORGANIC Green Jasmine Tea. Can be consumed hot or cold. Sweetened by default, please adjust sweetness level to your liking."
        },
        {
          "name": "Milk Teas",
          "description": "Our signature, freshly brewed ORGANIC Earl Grey Tea with our own recipe of non-dairy creamer. Can be consumed hot or cold."
        },
        {
          "name": "Matcha Lattea",
          "description": "Our YOYO! Matcha powder straight from Japan, combined with Soy milk. Perfect for every Matcha lover!"
        },
        {
          "name": "Matcha Lattea Espresso",
          "description": "Our YOYO! Matcha powder straight from Japan, combined with Soy milk and a shot of Espresso. Bold flavours guaranteed!"
        },
        {
          "name": "Coconut Milk",
          "description": "Our creamy Coconut milkshake is made with our own custom-made ingredients. The best Coconut milkshake you will ever have!"
        },
        {
          "name": "Brown Sugar Milk Tea",
          "description": "Our signature, freshly brewed ORGANIC Green Jasmine Tea with our own recipe of non-dairy creamer and brown sugar syrup."
        },
        {
          "name": "Taro Coconut Milk",
          "description": "BESTSELLER: A creamy and sweet milkshake of Coconut milk, Taro (purple coloured sweet potato with a sweet vanilla and cookies flavour) and our unique creamer."
        },
        {
          "name": "Taro Milk Tea",
          "description": "Our signature, freshly brewed ORGANIC Earl Grey Tea with our own recipe of non-dairy creamer and Taro."
        }
      ]
    },
    {
      "id": "fresh-ice-tea",
      "name": "Fresh Ice Teas",
      "items": [
        {
          "name": "Peach Soda & Yakult",
          "description": "Our favourite! Freshly brewed ORGANIC Green Jasmine iced tea with Peach syrup, fresh Lemon wheels, probiotic drink Yakult Plus and topped with sparkling water."
        },
        {
          "name": "Orange Blend",
          "description": "REFRESHING ICED TEA ALERT! Fresh Orange Juice with Watermelon syrup and our freshly brewed ORGANIC Green Jasmine Tea."
        },
        {
          "name": "Honey Mint",
          "description": "Classic iced tea with great quality honey, freshly brewed ORGANIC Green Jasmine tea, fresh mint leaves and fresh lime."
        },
        {
          "name": "Green Tea & Yakult",
          "description": "A very unique refreshing and creamy iced tea: freshly brewed ORGANIC Green Jasmine Tea with probiotic drink Yakult Plus and fresh lime."
        },
        {
          "name": "Strawberry Mint",
          "description": "BESTSELLER! This sweet iced tea is made with our ORGANIC Green Jasmine Tea, strawberry syrup, fresh mint leaves and fresh lime."
        },
        {
          "name": "Hong Kong Lemon Tea",
          "description": "Our ORGANIC Earl Grey Tea with fresh lemons and a touch of sugar makes a perfectly refreshing iced tea!"
        }
      ]
    },
    {
      "id": "create-your-own",
      "name": "Create Your Own",
      "items": [
        {
          "name": "Lychee",
          "description": "Our ORGANIC Green Jasmine iced tea with a sweet Lychee fruit flavour."
        },
        {
          "name": "Strawberry",
          "description": "Our ORGANIC Green Jasmine iced tea with a sweet Strawberry flavour."
        },
        {
          "name": "Lemon",
          "description": "Our ORGANIC Green Jasmine iced tea with a refreshing Lemon flavour."
        },
        {
          "name": "Honeydew Melon",
          "description": "Our ORGANIC Green Jasmine iced tea with a sweet Honeydew Melon flavour."
        },
        {
          "name": "Mango",
          "description": "Our ORGANIC Green Jasmine iced tea with a sweet and unforgettable Mango flavour."
        },
        {
          "name": "Passionfruit",
          "description": "Our ORGANIC Green Jasmine iced tea with a sweet Passionfruit pulp and Passionfruit seeds."
        }
      ]
    },
    {
      "id": "specials",
      "name": "YoYo! Specials",
      "items": [
        {
          "name": "Matcha Strawberry",
          "description": "Matcha Meets Strawberry! Earthy matcha and sweet strawberries swirl into one creamy, dreamy iced drink."
        },
        {
          "name": "Matcha Mango",
          "description": "A vibrant blend of earthy Japanese matcha and sweet tropical mango, shaken to perfection with your choice of milk."
        },
        {
          "name": "Black Sesame Chocolate Milk Tea",
          "description": "Our aromatic Green Jasmine Tea with rich cocoa and milk, married with a toasty black sesame wave of flavours."
        },
        {
          "name": "Rose Coconut Milk Tea",
          "description": "Spread the love with our Rose Coconut Milk Tea! Infused with a hint of rose, it is the coconut milk tea reinvented!"
        },
        {
          "name": "Chocolate Milk Tea",
          "description": "Our aromatic Green Jasmine Tea with rich cocoa and milk. Smooth, rich and satisfying!"
        },
        {
          "name": "Pumpkin Spice Espresso Milk Tea",
          "description": "Heartwarming and soothing, a must drink in the cold season of the year!"
        },
        {
          "name": "Lychee Sunset",
          "description": "A very refreshing and easy to like drink for everyone. Based on a nutty Oolong Tea combined with sweet Lychees and balanced with Lemons and Mandarins."
        },
        {
          "name": "The Special Coconut",
          "description": "It's so special, it's just like an Asian dessert! Our own Coconut milkshake combined with aromatic Pandan flavours."
        }
      ]
    },
    {
      "id": "bites",
      "name": "Bites",
      "items": [
        {
          "name": "The Special Coconut Cookie",
          "description": "Fragrant pandan and creamy coconut come together in our cookie."
        },
        {
          "name": "Matcha Strawberry Cookie",
          "description": "Earthy Japanese matcha and sweet strawberry jam."
        },
        {
          "name": "Ube Cookie",
          "description": "Ube (purple yam) cookie packed with ube, premium white chocolate, shredded coconut flakes and bits of macadamia nuts."
        },
        {
          "name": "Matcha White Choco Cookie",
          "description": "Organic high quality matcha (green tea) crunchy soft cookie filled with white premium chocolate."
        },
        {
          "name": "Kinder Bueno Cookie",
          "description": "A big vanilla cookie with a creamy hazelnut filling, premium milk chocolate and topped with a Kinder Bueno wafer."
        },
        {
          "name": "Birthday Cookie",
          "description": "Vanilla cookie, premium white chocolate callets and celebration sprinkles!"
        }
      ]
    }
  ]
}
